/* 2253209 刘佳朋 信07 */
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

/* ----具体要求----
   1、不允许添加其它头文件
   2、不允许定义全局变量、静态局部变量
   3、不允许添加其它函数
   4、整个程序不允许出现任何形式的循环
   --------------------------------------------------------------------- */

   /***************************************************************************
	 函数名称：
	 功    能：将整数n分解后输出
	 输入参数：
	 返 回 值：
	 说    明：1、函数名、形参、返回类型均不准动
			   2、不允许使用64位整数
   ***************************************************************************/
void convert(int n)
{
	if (n < 0)
	{
		printf("- ");
		if (n >= -2147483647)
		{
			n = -n;
		}
	}
	if (0 <= n && n <= 9)
	{
		printf("%c ", (char)(n+48));
	}
	else if (10 <= n && n <= 99)
	{
		printf("%c ", (char)(n/10 + 48));
		convert(n - n / 10 * 10);
	}
	else if (100 <= n && n <= 999)
	{
		printf("%c ", (char)(n / 100 + 48));
		convert(n - n / 100 * 100);
	}
	else if (1000 <= n && n <= 9999)
	{
		printf("%c ", (char)(n / 1000 + 48));
		convert(n - n / 1000 * 1000);
	}
	else if (10000 <= n && n <= 99999)
	{
		printf("%c ", (char)(n / 10000 + 48));
		convert(n - n / 10000 * 10000);
	}
	else if (100000 <= n && n <= 999999)
	{
		printf("%c ", (char)(n / 100000 + 48));
		convert(n - n / 100000 * 100000);
	}
	else if (1000000 <= n && n <= 9999999)
	{
		printf("%c ", (char)(n / 1000000 + 48));
		convert(n - n / 1000000 * 1000000);
	}
	else if (10000000 <= n && n <= 99999999)
	{
		printf("%c ", (char)(n / 10000000 + 48));
		convert(n - n / 10000000 * 10000000);
	}
	else if (100000000 <= n && n <= 999999999)
	{
		printf("%c ", (char)(n / 100000000 + 48));
		convert(n - n / 100000000 * 100000000);
	}
	else
	{
		if (n < -2147483647)
		{
			printf("%c ", (char)(-(n / 1000000000) + 48));
			convert( - (n - n / 1000000000 * 1000000000));
		}
		else
		{
			printf("%c ", (char)(n / 1000000000 + 48));
			convert(n - n / 1000000000 * 1000000000);
		}
	}
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main函数不准动
***************************************************************************/
int main()
{
	int n;
	printf("请输入一个整数\n");
	scanf("%d", &n);

	convert(n);
	printf("\n");

	return 0;
}